# Variable scope 
# --------------
# local ตัวแปรในฟังก์ชั่น  global ตัวแปรนอกฟังก์ชั่น 
# ตัวแปรที่อยู่นอกฟังก์ชั่นจะไม่สามารถดึงข้อมูลที่อยู่ในฟังก์ชั่นได้ 
# โปรแกรมที่อยู่คนละ Variable scope จะถือว่าเป็นตัวแปรคนละตัวกันแม้ว่าจะชื่อเดียวกันก็ตาม
# ++ ตัวแปรที่อยู่ใน global หากนำมาใช้ใน local scope นั้นสามารถใช้งานได้ 
# แต่จะไม่สามารถแก้ไขค่าได้นะ แต่ถ้าเราใช้ฟังก์ชั่น global (var) เราจะสามารถนำตัวแปรชนิด global 
# ที่นำใาใช้ใน local scope นั้นสามารถนำมาใช้และแก้ไขค่าได้

# Dictionary
# --------- 
# เป็นโครงสร้างข้อมูลชนิดหนึ่ง โดยใช้ {} มีลักษณะของ key,value 
# ซึ่งเป็นความสามารถพิเศษของ dict ที่เราสามารถตั้งชื่อ index ขึ้นเองได้ a = {key1:value1,key2,value2,..,key n:value n} 
# เป็นข้อมูลแบบ Mutable เปลี่ยนแปลงได้

# Dict การเพิ่ม-เปลี่ยนข้อมูล
# --------------------- 
# dict[key] = value 
# ถ้ามี key นั้นอยู่แล้วจะเป็นการเปลี่ยนแปลงค่า value 
# ถ้า dict นั้นๆ ยังไม่มี key จะเป็นการเพิ่มข้อมูลโดยอัตโนมัติ

# Dict การลบข้อมูล
# -------------- 
# dictName.pop(key) = ลบข้อมูลในตัวแปรโดยระบุ key นั้นๆ 
# dictName.popitem() = เอาตัวสุดท้ายออก 
# นอกนั้นคำสั่งคล้ายๆ list เลย

# การดึงค่า key ,value ,key-value
# -----------------------------
# i   = dictName.key()   จะเก็บค่า key        ไว้ในตัวแปร i
# j   = dictName.value() จะเก็บค่า value      ไว้ในตัวแปร j
# i,j = dictName.item()  จะเก็บค่า key,value  ไว้ในตัวแปร i,j ตามลำดับ

# การเพิ่มข้อมูล nested dict
# -----------------------
# เนื่องจากเหมือน dict ซ้อนๆกันเราควรสร้างข้อมูลด้านในก่อน 
# {'65010001': {'python': 50, 'calculus': 60}} 
# ถ้าเรายังไม่มี key student เราควรรับค่า suject,score เก็บไว้ใน dict ก่อน (เพราะยังไม่รู้จัก key student)
# / จากนั้นจึงค่อยนำก้อน dict เก็บไว้ใน dict ที่มี key เป็น student
# all_score[student] = {subject:score} 
# แต่ถ้าเรามี key student แล้ว เราสามารถนำค่าเข้าโดยตรงได้เลย 
# all_score[student][subject] = score


